app/controllers/authors/accounts_controller.rb

UPDATE "authors" SET "email" = $1, "bio" = $2, "updated_at" = $3 WHERE "authors"."id" = $4  [["email", "triko2020@gmail.com"], ["bio", "I'm 21 years old."], ["updated_at", "2017-04-30 16:23:58.106623"], ["id", 1]]
---
		def update_info
			# email must be formatted correctly +
			# name is required on update +

			if current_author.update(author_info_params)