app/controllers/authors/posts_controller.rb

  def create
    @post = current_author.posts.new(post_params)
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "description", "slug", "created_at", "updated_at", "banner_image_url") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "asd"], ["body", ""], ["description", ""], ["slug", ""], ["created_at", "2017-04-25 09:53:00.093640"], ["updated_at", "2017-04-25 09:53:00.093640"], ["banner_image_url", ""]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "description" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["description", "some descsription hereasddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd"], ["updated_at", "2017-04-30 08:10:06.028629"], ["id", 1]]

    def set_post
      @post = current_author.posts.friendly.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ? ORDER BY "posts"."id" DESC  [["author_id", 1]]